{"config": {"layers": [{"config": {"batch_input_shape": [null, 32, 32, 4], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_1", "W_regularizer": null, "nb_col": 3, "bias": true, "nb_filter": 16, "b_constraint": null, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_2", "W_regularizer": null, "nb_col": 3, "bias": true, "nb_filter": 16, "b_constraint": null, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_3", "W_regularizer": null, "nb_col": 3, "bias": true, "nb_filter": 16, "b_constraint": null, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_4", "W_regularizer": null, "nb_col": 3, "bias": true, "nb_filter": 16, "b_constraint": null, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_5", "W_regularizer": null, "nb_col": 3, "bias": true, "nb_filter": 16, "b_constraint": null, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_6", "W_regularizer": null, "nb_col": 3, "bias": true, "nb_filter": 16, "b_constraint": null, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "convolution2d_6", "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "same", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "maxpooling2d_1", "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_7", "W_regularizer": null, "nb_col": 3, "bias": true, "nb_filter": 4, "b_constraint": null, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_7", "class_name": "Convolution2D"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["convolution2d_7", 0, 0]]}, "keras_version": "1.1.1", "class_name": "Model"}