{"keras_version": "1.1.1", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 32, 32, 4], "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"padding": [2, 2], "trainable": true, "name": "zeropadding2d_1"}, "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "ZeroPadding2D", "name": "zeropadding2d_1"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_1", "border_mode": "same", "b_regularizer": null, "nb_filter": 16, "activation": "relu", "nb_row": 3, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "bias": true}, "inbound_nodes": [[["zeropadding2d_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_1"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_2", "border_mode": "same", "b_regularizer": null, "nb_filter": 16, "activation": "relu", "nb_row": 3, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "bias": true}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_2"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_3", "border_mode": "same", "b_regularizer": null, "nb_filter": 16, "activation": "relu", "nb_row": 3, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "bias": true}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_3"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_4", "border_mode": "same", "b_regularizer": null, "nb_filter": 16, "activation": "relu", "nb_row": 3, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "bias": true}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_4"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_5", "border_mode": "same", "b_regularizer": null, "nb_filter": 16, "activation": "relu", "nb_row": 3, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "bias": true}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_5"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_6", "border_mode": "same", "b_regularizer": null, "nb_filter": 16, "activation": "relu", "nb_row": 3, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "bias": true}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_6"}, {"config": {"trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "same", "dim_ordering": "tf", "pool_size": [2, 2]}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "MaxPooling2D", "name": "maxpooling2d_1"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_7", "border_mode": "same", "b_regularizer": null, "nb_filter": 4, "activation": "relu", "nb_row": 3, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "bias": true}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_7"}, {"config": {"trainable": true, "cropping": [[1, 1], [1, 1]], "name": "cropping2d_1"}, "inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "Cropping2D", "name": "cropping2d_1"}], "output_layers": [["cropping2d_1", 0, 0]], "name": "model_1"}}