{"keras_version": "1.2.1", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "icon_goes_here", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 4], "input_dtype": "float32", "name": "icon_goes_here"}}, {"class_name": "Convolution2D", "name": "convolution2d_7", "inbound_nodes": [[["icon_goes_here", 0, 0]]], "config": {"border_mode": "same", "trainable": true, "nb_col": 4, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_row": 4, "activation": "relu", "name": "convolution2d_7", "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.10000000149011612, "l1": 0.0}, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null}}, {"class_name": "Convolution2D", "name": "convolution2d_8", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"border_mode": "same", "trainable": true, "nb_col": 4, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_row": 4, "activation": "relu", "name": "convolution2d_8", "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.10000000149011612, "l1": 0.0}, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null}}, {"class_name": "Convolution2D", "name": "convolution2d_9", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"border_mode": "same", "trainable": true, "nb_col": 4, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_row": 4, "activation": "relu", "name": "convolution2d_9", "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.10000000149011612, "l1": 0.0}, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null}}, {"class_name": "Convolution2D", "name": "convolution2d_10", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"border_mode": "same", "trainable": true, "nb_col": 4, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_row": 4, "activation": "relu", "name": "convolution2d_10", "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.10000000149011612, "l1": 0.0}, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null}}, {"class_name": "Convolution2D", "name": "convolution2d_11", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"border_mode": "same", "trainable": true, "nb_col": 4, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_row": 4, "activation": "relu", "name": "convolution2d_11", "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.10000000149011612, "l1": 0.0}, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 16, "dim_ordering": "tf", "activity_regularizer": null}}, {"class_name": "Convolution2D", "name": "convolution2d_12", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"border_mode": "same", "trainable": true, "nb_col": 4, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_row": 4, "activation": "relu", "name": "convolution2d_12", "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.10000000149011612, "l1": 0.0}, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 4, "dim_ordering": "tf", "activity_regularizer": null}}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_2", "inbound_nodes": [[["convolution2d_12", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "averagepooling2d_2"}}], "output_layers": [["averagepooling2d_2", 0, 0]], "input_layers": [["icon_goes_here", 0, 0]], "name": "model_2"}}